{
  "text_1": "Grimdark PC Build",
  "text_2": "Quick Select",
  "text_3": "Inspiration",
  "text_4": "Parts List",
  "text_5": "Prep Work",
  "text_6": "Rough Technical Design",
  "text_7": "CAD and Testing",
  "text_8": "Manufacturing & Assembly",
  "text_9": "Cooling, Thermals & EMI",
  "text_10": "Materials Finish",
  "text_11": "Optronic LAN",
  "text_12": "Video",
  "text_13": "Warhammer 40,000 was once very inspiring to a small but very creative and fiercely loyal fan base across Western Civilisation. When Games Workshop first conceived this sci-fi genre ~30 years ago, it was a rich blend of themes like Medieval, central European, pseudo Christian, sci-fi, bio-cybernetic, feudal, nationalist, Gothic and gritty. The original creators have long since left and formed Warlord Games. Since then, each new generation of Games Workshop have undermined and corrupted the original theme. At this point that team have ceased the pretence of just pandering to a wider audience for commercial reasons. They now shamelessly push the same godless, Marxist filth as the rest of the globalist media and entertainment corporations: Hollywood, social media, Disney, BBC, etc. Games Workshop started out narrating the story of the grim darkness of the 41st millennium from the perspective of the protagonist, The Imperium of Man, locked in a bitter struggle for survival in the face of a cold and spiteful universe hell-bent on the extermination of Man. Now Games Wokeshop have fully fallen into the embrace of the antagonist and embody the Gods of Chaos: lawless, perverse, debased and violently self-destructive.",
  "text_14": "I fully reject all that anti-Christian degeneracy with extreme prejudice. I especially reject the perfidious Games Wokeshop and the tasteless grey sludge they've been slopping out over the past decade +. I return to the rich roots of this beautiful and complex sci-fi genre because it's story distantly resembles my own: a Christian beset on all sides, enemies without and within who butcher people like me in deranged spite. The original theme interwove real science, maths, Christianity, and history with pseudo-science and pure fantasy. Like most sci-fi, it was a fun and energetic thought experiment without getting too tied down in detail, and the blend was particularly rich, smooth and delicious. When I got a new PC I decided to use this as an opportunity to create a work of art inspired by real Warhammer 40,000. My design is intended to be very artistic but firmly grounded in sound engineering principles, a deep, seamless blend of form and function. I call this style \"Grimdark\". Think HR Giger but non-sexual, real engineering and a ton more skulls. Enjoy! ^_^",
  "text_15": "During my initial exploration of this theme, I wanted to get a quick feel for the style I was aiming for. When I sketch a building or ornament, the process gives me a more tangable grasp of the design as I study and pencil down the geometry. So I drew various structures in the pseudo-gothic style, inspired by architecture and ornaments from across the City of Edinburgh. Only 'pseudo' gothic because these examples are an imitation of the gothic style which pay no heed to the engineering principles, yet still carry similar visual character of the original movement in the 12th-16th centuaries.",
  "text_16": "The defining engineering feature of the Gothic style is its reliance on compressive forces, which were used to build the majestic cathedrals of Medieval Europe. These structures followed distinctly different design principles from the castles of the time. Castles, designed for military defense and counter-siege craft, were built to be incredibly robust. With walls several meters thick, castle architecture is very stout resulting in dark interiors. Their sheer bulk and strength made castles the superweapons of their era, maximised to project power and intimidation not beauty nor elegance.",
  "text_17": "The Opus Francigenum style, or 'French Work' (Gothic) emerged as a dominant form of architecture in the 12th starting in Frankish lands (modern France, Germany and Spain) then rapidly spread across Christendom by highly sought after artisans: master builders, ironworkers, stonemasons, carpenters, glassmakers, renderers and a veritable army of support workers. Over ~300 years and much trial and error, architects finally perfected the creative use of compressive forces to create towering, airy structures. These buildings stood as monolithic feats of engineering, incorporating geometry that still holds up nearly a millennium later. These craftsmen interwove form and function into a glorious, inseparable synergy.",
  "text_18": "This style introduced iconic geometric elements such as the lancet arch, vaulted ceilings, reinforced buttresses, soaring spires, and heavy pinnacle stones. Although these features are beautiful they're not ornamental—they are physical manifestations of the underlying physical principles that have allowed these majestic edifices to remain standing as ancient heirlooms belonging to the nations Europe.",
  "text_19": "While Gothic architecture relies heavily on compression, objects that 'hang'—like chandeliers, candleholders, incense censer, etc —depend on tension, the exact opposite of compression. This contrast in forces reveals my dilemma in designing a \"hanging Gothic PC case\".",
  "text_20": "Hanging chains were used by master designers, engineers and architects as an early form of finite element analysis simulation. Once a design solution had been found the model would be inverted then built, so a hanging gothic design is quite literally upside down. Learn more about this interesting process here.",
  "text_21": "My solution to work around this apparent design contradiction is to create 1 foundation type structure which is suspended by strong chains from the ceiling. From this foundation every other component is placed on top and so under the conventional compressive forces found in gothic design. Anything designed and built from scratch is very complex and resource intensive. So to simplify the process a little this \"suspended foundation\" design is able to constrain the design choices to mostly compressive forces after the suspended foundation is built. For me, the extra effort this design choice entails is worth it. This choice ensures the PC and its case will not only appear gothic design in form, but also be gothic in its structural function. Form and function interwoven in harmonious synergy.",
  "text_22": "This attention to synergetic detail is not only applied to the main, most visible, external components but is also applied to internal components. Connective braces, brackets and clasps likewise serve well in both form and function. The beautiful latticework of these connective components serves to make the internal structure not only more ridged due to cross bracing, but also more elastic allowing for greater shock absorbing properties if the PC case happens to get bumped or dropped. Because the lattice work is so fine it only contributes a small amount of additional mass while adding huge gains in form and function. here are so many components and features that I've used biological concepts to create subcategories to organise the components into intuitive categories, these are:",
  "text_23": "Parts List",
  "text_24": "With lots of assistance from my brother, the electronic PC components were selected, analysed, re-analysed, debated and purchased. The goal was to create a system with low initial specifications but decent upgrade potential. My next project will be a game engine oriented around AI training. The minimum requirements for that project are a CPU with +4 cores and a GPU with 6GB of VRAM. With generous support, the minimum requirements were easily exceeded and this will turn out to be a gaming/game dev machine far beyond my initial intention. The motherboard and power supply were chosen so this setup can be upgraded to become a very small domestic AI server to practice and learn about multiplexing AI tasks across multiple GPUs. It won't be sufficient to run good LLMs at 20tps inferencing rates, but will be very sufficient for my needs in learning and building very small AI models. All in, for the price tag it's a very nice setup and greatly exceeds the minimum requirement of a basic machine to learn on. Thank you to my brother for that assistance, and sorry for not getting a GTX1080!",
  "text_25": "Cooling: Custom purified air system with 4 x 120mm fans arranged in a parallel box configuration, true HEPA cylindrical particulate filter and activated charcoal screen. Custom ducting, mounting and airtight sealing across the whole case will be used to create a linear airflow path from bottom to top. Internal thermal and flow regulation could be added with later upgrades. More about this later.",
  "text_26": "Prep Work",
  "text_27": "Many of the structural/skeletal/connective components are from non-computing fields, like a 2 ton automotive tow chain, malleable iron pipework, garden awning cables and connections etc. The heavy metal components and some of the 2nd hand components needed cleaning and even some needed deburring before they could be allowed to come in contact with clean, sealed computer electronics. Some of the heavy metal components had to be machined and surface preparation is everything. Sharp edges and manufacturing artifacts were thoroughly deburred and sanded, then isopropyl alcohol wipes and acetone solvent were used to clean, degrease and remove many particulates from the heavy metal components. The cleaning process was laborious but the steps were repeated many times (~3-7) until no further dirt was observed on a clean, white alcohol wipe.",
  "text_28": "The workspace has a severe dust problem, so all extra fabric was removed from the room and the carpet floor and horizontal surfaces were wet cleaned multiple times across the duration of the project. This is far from a clean room setup but is the highest cleanliness possible with the resources available. When handling electronics, nitrile gloves were used and the work station was set up on a grounded anti-static mat. In addition I was plugged into the grounded anti-static circuit to further reduce any chance my body might cause a static overload in the sensitive, exposed electrical components. All components were left sealed in packaging until the very last moment before installation, or minimal removal during the design and testing phases. Once the materials and workspace were prepared, the design and build phases commenced.",
  "text_29": "Rough Technical Design",
  "text_30": "Layout",
  "text_31": "As previously mentioned, because the project is so complex, the components are placed in categories inspired by anatomy. Bones, Cartilage, Ligaments, Tendons etc. The underlying iron pipe structure is the toughest component and is catagorised under \"Venatus Ossificatrix\", or \"Venerable Matrix of Bones\" in low gothic. These are given added rigidity in their off-axes by ornate, 3D printed \"Cartilagus\" aka \"cartilage\". The 4 chains that hold up the whole structure are \"Tendo Ferrum\" or \"iron tendons\". This categorisation method allowed for great organisation across many complex systems but without getting too distracted by the fun, creative process of coming up with new concepts and categories, just drawing on God's creation for inspiration instead.",
  "text_32": "Sketches",
  "text_33": "To check the viability of a few ideas quickly, rough technical sketches were drawn. They are 1:8 scale with moderate attention to accuracy, to produce drawings that quite closely represent a full scale design and build phases. This allowed for rapid, low cost, low risk testing of ideas. Design concepts were tested against these simple paper models to debug design flaws before they crept up in the full scale, expensive build. This was a fast and cheap way to iterate though a few ideas until a design was found. This method is not a substitute for proper care and attention to detail during design, manufacturing and assembly, but is just a handy little tool in the engineers' toolbox.",
  "text_34": "Testing and CAD",
  "text_35": "Mass Testing",
  "text_36": "Because the completed PC and case was projected to weigh +10kg (later discovered to be 18.25kg), testing the key structural components was required. If anyone key structural component were to fail, it would be an expensive accident with little chance of recovery. The mass of each of the main components was found and key components were tested at ~300% their nominal load or to breaking, whichever would come first. The testing and large safety margin will allow for full peace of mind that the PC case will be mounted very securely. Once the stress testing was complete the structural integrity of the device drew no further attention and energies could fully move on to other matters without fear.",
  "text_37": "The mass of the main components were found to be:",
  "text_38": "2.15kg: Medullum (fragile internal components like Motherboard, GPU, RAM, Memory etc)",
  "text_39": "1.7kg: Power Supply Unit",
  "text_40": "5.2kg: Venatus Ossifactrix (Skeletal pipework and 3D printed cartilage)",
  "text_41": "6.4kg: Chain tendons and ligaments",
  "text_42": "0.7kg: The Alveolus Machina (air filters and primary inlet fan system)",
  "text_43": "0.0kg: Cranium (tough external elements)",
  "text_44": "2.1kg: Cabling",
  "text_45": "18.25kg: Total",
  "text_46": "60.0kg: Wooden Ceiling Joists",
  "text_47": "60.0kg: Mounting bolts (4 bolts, 15.0kg each)",
  "text_48": "30.0kg: Mounting brackets (only 150% of standard load because there was not enough test mass available)",
  "text_49": "33.9kg: Chain tendons and ligaments (4 chains, 8.5kg each)",
  "text_50": "0.0kg: Skeletal pipework",
  "text_51": "0.0kg: 3D printed PLA cartilage",
  "text_52": "All the key components passed stress testing without any signs of deformation. This was taken as an indication the components will comfortably stand up under 200% less mass representing the strain the PC case will actually experience under normal conditions.",
  "text_53": "CAD",
  "text_54": "The key structural components were tested at 300% of their nominal load. Exercise weights were used as a dummy test mass. Before testing, the components were inspected to observe their pre-test condition. The key components were placed under load and left to sit for 24h under the excess strain. After testing, the components were inspected for signs of deformation. The key components and the load tested were (ordered by max mass first to represent the orientation of tensile forces):",
  "text_55": "FreeCAD was used to design the 3D printed components. These included brackets, braces and mounting points. The structural components were tested at 300% expected load to ensure they would properly support the PC components under normal working load.",
  "text_56": "While prototyping 3D printed components it was discovered that inserting heated brass inserts by hand was creating many alignment issues. So over about 1 day and 3 prototypes, a mount was created to clasp the heated brass insert tool in my drill press. The drill press makes for a very sturdy platform and good control over the downward force used to press in the heated brass insert. Brass inserts are now pressed into 3D printed components with good accuracy and consistency thanks to this new, drill press/heated insert comb-tool. As a fun aside, while developing this multi-tool, a technique to add raised text to CAD models was discovered. This will open the ability to add cool, raised text to 3D models in the future.",
  "text_57": "It was discovered that gothic tracery can double as a compliant mechanism if designed correctly. A compliant mechanism is a device that allows for some elasticity under load without breaking. This design principle can be used to create extremely compact, highly resiliant components that can achive a very high precision range of movement, like a printed microscope control stage. It was discovered that popular gothic filigree patterns can be tweaked to provide compliant-like behavior while also being very beautiful and adding strength and rigidity to the structure. This discovery aligns very well with my attempt to ensure as many components as possible serve both form and function. However this discovery won't be relevant for this project, just something to bear in mind for future design work.",
  "text_58": "Manufacturing & Assembly",
  "text_59": "Content coming soon.",
  "text_60": "Cooling, Thermals & EMI",
  "text_61": "Content coming soon.",
  "text_62": "Materials Finish",
  "text_63": "Paint, Marble, Glass, Electro-Metal & Spotlight Finishes coming soon.",
  "text_64": "Optronic LAN",
  "text_65": "Content coming soon.",
  "text_66": "Video",
  "text_67": "Content coming soon."
}
