{
    "text_1": "Мрачная сборка ПК",
    "text_2": "Быстрый выбор",
    "text_3": "Вдохновение",
    "text_4": "Список компонентов",
    "text_5": "Подготовка",
    "text_6": "Грубый технический дизайн",
    "text_7": "CAD и тестирование",
    "text_8": "Производство и сборка",
    "text_9": "Охлаждение, термалы и ЭМИ",
    "text_10": "Материалы и дизайн",
    "text_11": "Опто-реический LAN",
    "text_12": "Видео",
    "text_13": "Warhammer 40,000 когда-то очень вдохновлял небольшую, но очень творческую и преданную фанатскую базу по всей западной цивилизации. Когда Games Workshop впервые задумала этот жанр научной фантастики около 30 лет назад, он представлял собой богатое сочетание таких тем, как средневековье, центральноевропейская, псевдохристианская, научная фантастика, биокибернетика, феодализм, национализм, готика и гритти. Первоначальные создатели давно ушли и основали Warlord Games. С тех пор каждое новое поколение Games Workshop извращало оригинальную тему. На данный момент команда перестала притворяться, что просто обслуживает более широкую аудиторию по коммерческим соображениям. Теперь они бесстыдно пропагандируют ту же безбожную марксистскую грязь, что и остальные глобалистские медиа и развлекательные корпорации: Голливуд, социальные сети, Disney, BBC и т.д. Мастерская игр началась с рассказа о мрачной тьме 41-го тысячелетия с точки зрения главного героя",
    "text_14": "Я полностью отвергаю все это антихристианское вырождение с крайним предубеждением. Особенно я отвергаю вероломные игры Wokeshop и безвкусную серую жижу, которую они выпускают на протяжении последнего десятилетия+. Я возвращаюсь к богатым истокам этого прекрасного и сложного научно-фантастического жанра, потому что его история отдаленно напоминает мою собственную: христианин, окруженный со всех сторон, враги снаружи и внутри, которые убивают таких людей, как я, в безумной злобе. В оригинальной теме переплелись реальная наука, математика, христианство и история с псевдонаукой и чистой фантазией. Как и в большинстве научно-фантастических произведений, это был веселый и энергичный мысленный эксперимент, не слишком вдававшийся в детали, и смесь получилась особенно насыщенной, гладкой и вкусной. Когда у меня появился новый компьютер, я решил использовать его как возможность создать произведение искусства, вдохновленное настоящим Warhammer 40,000. Мой дизайн должен быть очень художественным, но в то же время основанным на принципах звукорежиссуры - глубоком, гармоничном сочетании формы и функциональности. Я называю этот стиль "Мрачный мрак". Вспомните Эйчара Гигера, но без сексуальности, с настоящей инженерией и большим количеством черепов. Наслаждайтесь! ^^",
    "text_15": "Во время моего первоначального изучения этой темы я хотел быстро понять, к какому стилю я стремлюсь. Когда я делаю набросок здания или орнамента, этот процесс дает мне более четкое представление о дизайне, поскольку я изучаю геометрию и обводю ее карандашом. Поэтому я нарисовал различные сооружения в псевдоготическом стиле, вдохновленный архитектурой и орнаментами со всего Эдинбурга. Только "псевдоготика", потому что эти образцы являются имитацией готического стиля, который не учитывает инженерных принципов, но все же сохраняет визуальный характер оригинального механизма 12-16 веков.",
    "text_16": "Определяющей инженерной особенностью готического стиля является его зависимость от сжимающих усилий, которые использовались при строительстве величественных соборов средневековой Европы. Эти сооружения строились по принципам, совершенно отличным от замков того времени. Замки, предназначенные для военной обороны и борьбы с осадой, были построены так, чтобы быть невероятно прочными. Стены толщиной в несколько метров придают замкам очень прочную архитектуру, что приводит к мрачным интерьерам. Их огромные размеры и прочность превратили замки в супероружие своей эпохи, предназначенное для демонстрации мощи и устрашения, а не красоты или элегантности.",
    "text_17": "Одно из самых замечательных сооружений готического стиля — это собор Парижской Богоматери, начатый в 1245 году на исторической площади, называемой Île de la Cité. В 1844 году наряду с симметричным западной фасадом собор получил еще один фасад, позаимствованный из соборских храмов в Германии, так называемый ризарион в виде трехризного замка, являющегося многовершинной башенной фигурой. Это уменьшает визуальный вес собора, но не уменьшает его прочность.",
    "text_18": "Стиль Опус Франжигенум, или \"Французская работа\" (готика), развился как доминирующая форма архитектуры в 12 веке во франках (современная Франция, Германия и Испания), а затем распространился по всей христианской Европе за счет искусно работавших мастеров: мастеров строительства, кузнецов, каменщиков, плотников, стекольщиков, преподавателей и целого армии поддержки. За более чем 300 лет и многочисленные неудачных попыток архитекторы наконец сумели использовать творчески сжимающие силы для создания высоких, воздушных сооружений. Эти сооружения стояли как монументальные инженерные шедевры, включая геометрию, которая до сих пор устоит не менее тысячелетия. Эти мастера проникали форму и функцию в неразделимое симбиотическое единство.",
    "text_19": "Во время моего первоначального исследования этого темы я хотел получить быстрый ощущение стиля, которому я стремлюсь.",
    "text_20": "Подвесные цепи использовались мастерами-дизайнерами, инженерами и архитекторами в качестве ранней формы моделирования методом конечных элементов. Как только было найдено дизайнерское решение, модель переворачивалась, а затем создавалась, так что подвесной готический дизайн в буквальном смысле перевернут с ног на голову. Узнайте больше об этом интересном процессе здесь.",
    "text_21": "Мое решение обойти это очевидное дизайнерское противоречие заключается в создании конструкции типа фундамента, которая подвешивается к потолку на прочных цепях. На этом фундаменте все остальные компоненты располагаются сверху и, таким образом, подвергаются обычным сжимающим усилиям, характерным для готического дизайна. Все, что проектируется и строится с нуля, является очень сложным и ресурсоемким. Поэтому, чтобы немного упростить процесс, эта конструкция "подвесного фундамента" позволяет ограничить выбор конструкции в основном сжимающими усилиями после возведения подвесного фундамента. На мой взгляд, дополнительные усилия, затраченные на такой выбор дизайна, того стоят. Такой выбор гарантирует, что ПК и его корпус будут не только иметь готический дизайн по форме, но и будут готическими по своим конструктивным функциям. Форма и функциональность гармонично переплетаются.",
    "text_22": "Такое внимание к деталям, создающим синергию, применяется не только к основным, наиболее заметным внешним компонентам, но и к внутренним компонентам. Соединительные скобы, кронштейны и застежки также хороши как по форме, так и по функциональному назначению. Красивая решетчатая структура этих соединительных элементов делает внутреннюю конструкцию не только более рельефной благодаря перекрестному креплению, но и более эластичной, что обеспечивает большую амортизацию при ударе или падении корпуса ПК. Поскольку решетчатая конструкция настолько тонкая, она придает лишь небольшую дополнительную массу, в то же время значительно улучшая форму и функциональность. здесь так много компонентов и функций, что я использовал биологические концепции для создания подкатегорий, чтобы организовать компоненты в интуитивно понятные категории, а именно:",
    "text_23": "Список компонентов",
    "text_24": "С большой помощью моего брата были выбраны, проанализированы, перепроверены, обсуждены и закуплены электронные компоненты для ПК. Целью было создать систему с низкими начальными характеристиками, но хорошим потенциалом для модернизации. Моим следующим проектом будет игровой движок, ориентированный на обучение ИИ. Минимальные требования для этого проекта - процессор с более чем 4 ядрами и графический процессор с 6 ГБ видеопамяти. Благодаря щедрой поддержке минимальные требования были легко превышены, и это будет машина для разработки игр, которая намного превосходит мои первоначальные намерения. Материнская плата и блок питания были выбраны таким образом, чтобы эта установка могла быть модернизирована и превратилась в очень маленький домашний сервер искусственного интеллекта для практики и изучения мультиплексирования задач искусственного интеллекта на нескольких графических процессорах. Этого будет недостаточно для запуска хороших LLM-систем со скоростью вывода 20 т/с, но этого будет вполне достаточно для моих нужд в обучении и создании очень маленьких моделей искусственного интеллекта. В целом, за такую цену это очень хорошая установка, которая значительно превосходит минимальные требования к базовой машине для обучения. Спасибо моему брату за помощь и извините, что у меня нет GTX1080!",
    "text_25": "Охлаждение: Специальная система очистки воздуха с 4 вентиляторами по 120 мм, расположенными в параллельной коробчатой конфигурации, цилиндрическим сажевым фильтром true HEPA и сеткой из активированного угля. Для создания линейного потока воздуха снизу вверх будут использованы специальные воздуховоды, монтаж и герметичное уплотнение по всему корпусу. При последующих обновлениях может быть добавлено внутреннее регулирование температуры и расхода. Подробнее об этом позже.",
    "text_26": "Подготовка",
    "text_27": "Многие конструктивные/каркасные/ соединительные компоненты не связаны с вычислительной техникой, например, автомобильная буксирная цепь весом 2 тонны, трубы из ковкого железа, тросы и соединения для садовых навесов и т.д. Компоненты из тяжелого металла и некоторые компоненты, изготовленные вручную, нуждались в очистке, а некоторые даже в удалении заусенцев, прежде чем они могли соприкасаться с чистой, герметичной компьютерной электроникой. Некоторые компоненты из тяжелого металла необходимо было обработать механической обработкой и подготовить поверхность. Острые кромки и производственные дефекты были тщательно очищены от заусенцев и шлифовки, затем были использованы салфетки из изопропилового спирта и ацетоновый растворитель для очистки, обезжиривания и удаления большого количества частиц с деталей из тяжелых металлов. Процесс очистки был трудоемким, но этапы повторялись много раз (~3-7), пока на чистой спиртовой салфетке не исчезали загрязнения.",
    "text_28": "В рабочей зоне возникла серьезная проблема с пылью, поэтому из помещения была убрана вся лишняя ткань, а пол с ковровым покрытием и горизонтальные поверхности несколько раз подвергались влажной уборке на протяжении всего проекта. Это далеко не самое чистое помещение, но при имеющихся ресурсах оно обеспечивает максимальную чистоту. При работе с электроникой использовались нитриловые перчатки, а рабочее место было установлено на заземленном антистатическом коврике. Кроме того, я был подключен к заземленной антистатической цепи, чтобы еще больше снизить вероятность того, что мое тело может вызвать статическую перегрузку чувствительных, открытых электрических компонентов. Все компоненты были упакованы в герметичную упаковку до самого последнего момента перед установкой или были извлечены в минимальном количестве на этапах проектирования и тестирования. Как только материалы и рабочее пространство были подготовлены, начались этапы проектирования и сборки.",
    "text_29": "Грубый технический дизайн",
    "text_30": "Расположение",
    "text_31": "Как упоминалось ранее, поскольку проект очень сложный, компоненты распределены по категориям, основанным на анатомии. Кости, хрящи, связки, сухожилия и т.д. Лежащая в основе конструкция из железных труб является самым прочным компонентом и называется "Venatus Ossificatrix", или "Древняя матрица костей" на низком готическом. Они имеют дополнительную жесткость при смещении от оси за счет декоративного 3D-принтера "Хрящ", он же "хрящевина". 4 цепи, которые удерживают всю конструкцию, называются "Tendo Ferrum" или "железные сухожилия". Этот метод категоризации позволил эффективно организовать работу многих сложных систем, но при этом не слишком отвлекаться на увлекательный творческий процесс создания новых концепций и категорий, а просто черпать вдохновение из Божьего творения.",
    "text_32": "Эскизы",
    "text_33": "Чтобы быстро проверить жизнеспособность нескольких идей, были сделаны грубые технические эскизы. Они выполнены в масштабе 1:8 с умеренным вниманием к точности, что позволило создать чертежи, которые достаточно точно отображают этапы проектирования и сборки в полном масштабе. Это позволило быстро, с минимальными затратами и рисками протестировать идеи. Концепции дизайна были протестированы на этих простых бумажных моделях, чтобы устранить недостатки дизайна, прежде чем они проявятся в полномасштабной дорогостоящей сборке. Это был быстрый и дешевый способ проработать несколько идей до тех пор, пока не будет найден дизайн. Этот метод не заменяет должной тщательности и внимания к деталям при проектировании, производстве и сборке, а является всего лишь небольшим удобным инструментом в арсенале инженеров.",
    "text_34": "Тестирование и CAD",
    "text_35": "Массовое тестирование",
    "text_36": "Поскольку вес готового ПК и корпуса должен был превышать 10 кг (позже выяснилось, что он составляет 18,25 кг), потребовалось тестирование ключевых конструктивных элементов. Если бы какой-либо ключевой элемент конструкции вышел из строя, это привело бы к дорогостоящей аварии с минимальными шансами на восстановление. Была определена масса каждого из основных компонентов, и ключевые компоненты были протестированы при нагрузке ~300% от номинальной или на разрыв, в зависимости от того, что произойдет раньше. Тестирование и большой запас прочности позволят быть уверенным в том, что корпус ПК будет установлен очень надежно. Как только стресс-тестирование было завершено, структурная целостность устройства больше не привлекала внимания, и energies могли без опаски переключиться на другие задачи.",
    "text_37": "Было установлено, что масса основных компонентов составляет:",
    "text_38": "2,15 кг: \"Medullum\" (хрупкие внутренние компоненты, такие как материнская плата, графический процессор, оперативная память и т.д.)",
    "text_39": "1,7 кг Блок питания ",
    "text_40": "5,2 кг: Venatus Ossifactrix (Скелетный трубопровод и хрящ, напечатанный на 3D-принтере)",
    "text_41": "6,4 кг: Сухожилия и связки цепи",
    "text_42": "0,7 кг:  The Alveolus Machina (воздушные фильтры и система первичного приточного вентилятора)",
    "text_43": "0,0 кг: Череп (жесткие внешние элементы)",
    "text_44": "2,1 кг: Кабель",
    "text_45": "18,25 кг: Всего",
    "text_46": "60,0 кг: Деревянные потолочные балки",
    "text_47": "60,0 кг: Крепежные болты (4 болта по 15,0 кг каждый)",
    "text_48": "30,0 кг: Монтажные кронштейны (только 150% от стандартной нагрузки, поскольку испытательной массы было недостаточно)",
    "text_49": "33,9 кг: Сухожилия и связки цепи (4 цепи по 8,5 кг каждая)",
    "text_50": "0,0кг: Каркасные трубопроводы",
    "text_51": "0,0 кг: PLA-хрящ с 3D-печатью",
    "text_52": "Все ключевые компоненты прошли стресс-тестирование без каких-либо признаков деформации. Это было сделано для того, чтобы убедиться, что компоненты будут выдерживать нагрузку, на 200% меньшую, чем та, которую испытывает корпус ПК в обычных условиях.",
    "text_53": "CAD",
    "text_54": "Основные конструктивные элементы были испытаны при нагрузке, составляющей 300% от их номинальной. В качестве испытательного веса использовались тренировочные утяжелители. Перед испытаниями компоненты были проверены на соответствие их состоянию перед испытаниями. Ключевые компоненты были подвергнуты нагрузке и выдержаны в течение 24 часов при избыточном напряжении. После испытания компоненты были проверены на наличие признаков деформации. Ключевые компоненты и испытываемая нагрузка были следующими (сначала отсортированы по максимальной массе, чтобы представить направление растягивающих усилий):",
    "text_55": "Для проектирования компонентов, напечатанных на 3D-принтере, использовался FreeCAD. В их число входили кронштейны, распорки и точки крепления. Конструктивные элементы были протестированы при 300% ожидаемой нагрузке, чтобы убедиться, что они будут надлежащим образом поддерживать компоненты ПК при нормальной рабочей нагрузке.",
    "text_56": "При создании прототипов компонентов, напечатанных на 3D-принтере, было обнаружено, что ручная установка нагретых латунных вставок создает множество проблем с выравниванием. Таким образом, примерно за 1 день и 3 прототипа было изготовлено крепление для крепления инструмента с нагретой латунной вставкой в моем сверлильном станке. Сверлильный станок обеспечивает очень прочную платформу и хороший контроль над направленным вниз усилием, используемым для вдавливания нагретой латунной пластины. Латунные пластины теперь запрессовываются в детали, напечатанные на 3D-принтере, с высокой точностью и последовательностью благодаря этому новому инструменту-гребенку для сверлильного станка/нагретой пластины. Кроме того, в ходе разработки этого многофункционального инструмента была обнаружена технология добавления рельефного текста к CAD-моделям. Это позволит в будущем добавлять интересный рельефный текст к 3D-моделям.",
    "text_57": "Было обнаружено, что готический узор при правильном проектировании может выполнять функцию податливого механизма. Податливый механизм - это устройство, которое обеспечивает некоторую эластичность при нагрузке, не разрушаясь. Этот принцип конструкции может быть использован для создания чрезвычайно компактных, обладающих высокой упругостью компонентов, которые могут обеспечивать очень высокую точность перемещения, например, для управления печатным микроскопом. Было обнаружено, что популярные готические филигранные узоры могут быть изменены таким образом, чтобы они были послушными и в то же время очень красивыми, а также придавали конструкции прочность и жесткость. Это открытие очень хорошо согласуется с моей попыткой обеспечить, чтобы как можно больше компонентов служили как форме, так и функции. Однако это открытие не будет иметь отношения к данному проекту, это просто то, что нужно иметь в виду при будущей проектной работе.",
    "text_58": "Производство и сборка",
    "text_59": "Содержимое скоро появится.",
    "text_60": "Охлаждение, термалы и ЭМИ",
    "text_61": "Содержимое скоро появится.",
    "text_62": "Финишные материалы",
    "text_63": "Краска, мрамор, стекло, электрометалл и осветительные приборы скоро появятся.",
    "text_64": "Оптико-электронная LAN",
    "text_65": "Содержимое скоро появится.",
    "text_66": "Видео",
    "text_67": "Содержимое скоро появится."
  }
  